var MongoClient = require('mongodb').MongoClient;
var DB_CONN_STR = 'mongodb://localhost:27017/menu';

var insertData = function (db, callback) {
    var collection = db.collection('recipe');
    var data = [
        {
            "id": 1,
            "material": "乌鸡半只，小香菇一把，红枣数枚，枸杞数粒，大葱一段，鲜姜三片，当归两片，盐适量。",
            "practice": "1. 乌鸡一只，去内脏、杂毛，清洗干净； 2. 用厨房剪将其剪成小块，然后清水清洗两遍，去除多余的血水； 3. 半只乌鸡、红枣、小香菇、枸杞、大葱段、鲜姜片、当归准备妥当； 4. 先将乌鸡入电饭煲内胆中，再放入小香菇、红枣； 5 . 将葱段、姜片、枸杞放入锅中； 6 . 加入适量的清水，盖上盖子，启动“煲汤”程序； 7 . 时间默认2小时； 8 . 出锅前根据口味加入盐，搅拌均匀。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E4%B9%8C%E9%B8%A1%E9%A6%99%E8%8F%87%E7%BA%A2%E6%9E%A3%E6%B1%A4.jpg"
        },
        {
            "id": 2,
            "material": "带皮五花肉800克，老抽30克，生抽60克，料酒25克，冰糖80克，八角3个，姜5片，葱1根，花椒40粒，花椒40粒，香叶3片，水690毫升。",
            "practice": " 1. 准备食材； 2. 五花肉凉水入锅，加入八角1个　姜2片，香叶2片，花椒20粒左右，大火烧开； 3. 煮至水沸腾，肉色变白即可捞出； 4. 略放至不烫手，用刀仔细刮去表层脏东西及杂毛； 5. 再均匀的切成每块3厘米的正方形； 6. 将切好的肉块再次放进锅中，打个滚即捞出备用； 7. 将剩余的葱姜花椒八角香叶摆在锅底，加入冰糖。并倒入生抽老抽料酒后再加入水； 8. 将肉摆在锅中，加入剩余的其它配料启动红烧肉功能开始烹饪； 9. 58分钟后，进入自动收汁模式。这时的肉，用筷子已经可以轻松扎透，非常软糯。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%85%83%E5%AE%9D%E7%BA%A2%E7%83%A7%E8%82%89.jpg"
        },
        {
            "id": 3,
            "material": "雪梨一只，银耳两朵，红枣五只，冰糖适量。",
            "practice": "1. 把雪梨削皮切成小块，银耳撕成小朵，红枣从中间切一刀，放进洗干净的砂锅中，加清水，没过食材； 2. 大火烧开转小火，炖至汤色微黄，用勺子舀起时汤汁有些粘稠，加冰糖熬至冰糖融化； 3. 关火，粥成。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%86%B0%E7%B3%96%E9%9B%AA%E6%A2%A8%E9%93%B6%E8%80%B3%E7%BE%B9.jpg"
        },
        {
            "id": 4,
            "material": "鸡翅中适量，可乐一听，八角适量，姜适量，葱段适量，料酒适量。",
            "practice": "1. 鸡翅洗净，入葱姜水中煮沸捞出，沥干水份； 2. 锅内放少许油烧热，放入鸡翅，煎至外皮两面泛黄； 3. 倒入可乐没过鸡翅即可； 4. 加入酱油、大料、葱段、姜片，大火烧开后转小火； 5. 炖至汤汁浓稠即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%8F%AF%E4%B9%90%E9%B8%A1%E7%BF%85.jpg"
        },
        {
            "id": 5,
            "material": "当归9g，川芎6g，熟地12g，白芍9g，红糖适量。",
            "practice": "1. 砂锅内上适量清水，放入清洗好的药材； 2. 加锅盖大火煮开，转中小火煮三十分钟； 3. 最后加入准备好的红糖再熬五分钟左右熄火； 4. 让汤凉四五分钟，用隔离勺把汤和药渣分开。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%9B%9B%E7%89%A9%E6%B1%A4.jpg"
        },
        {
            "id": 6,
            "material": "五花肉半斤，尖椒一个，青蒜4-5根，（其实正宗的回锅肉还要放豆干，再放根红椒点缀，咱家没有，省略了），白糖2茶勺，生抽1汤勺，盐2克，鸡精，料酒，姜片，葱段；蒜片，郫县豆瓣酱1汤勺。",
            "practice": "1、青椒切菱形段，青蒜拍一下蒜头，切寸段。蒜头和蒜叶分开放。 2、预先处理过的五花肉切薄片，越薄越好。俺就这刀工了，算比较厚的啊。 3、蒜拍碎（没拍），郫县豆瓣剁成茸（碎点儿好看也好吃）。 4、处理好的肉片下油锅，旺火煸炒。直至肉片打卷，变得焦黄。 5、将超好的肉片拨至一边，下入蒜末和郫县豆瓣，用小火炒出红油。 6、倒入尖椒段和青蒜蒜头，烹入糖，生抽，盐。注意：郫县豆瓣酱和生抽均有咸度，盐一定要酌情放。 7、待尖椒和蒜头香味出来，放入青蒜叶及鸡精兜匀。青蒜叶熟的很快，这个步骤只需要30秒或者更短，只要看到青蒜叶被油裹住就可以了。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%9B%9E%E9%94%85%E8%82%89.jpg"
        },
        {
            "id": 7,
            "material": " 主料：鲫鱼500克， 辅料：白萝卜250克，豌豆苗10克， 调料：料酒10克，味精5克，盐2克，猪油50克，大葱5克，姜5克",
            "practice": "1.将鲫鱼去鳞、去鳃、去鳍，从鱼鳃一侧靠下部，用刀尖切成半月牙形，抠取内脏，不要弄破苦胆，鱼子不要掏出，衍净内膛；然后在鱼身两侧剞直刀，将鱼下和沸水中氽一下备用； 2.将白萝卜洗净，刮净皮，斜刀切成丝，下入沸水中焯一下捞出备用； 3.豆苗洗净，用其嫩尖； 4.将炒锅置火上，下入大油，用葱（切末）、姜（切末）炝锅，加上奶汤，放入料酒、味精、盐、毛姜水，把鱼下入烩煮； 5.再将萝卜丝放入锅内，同鱼一起烩烂，出锅时，调好口味，撒上豆苗，淋上少许明油即成。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%A5%B6%E6%B1%A4%E9%B2%AB%E9%B1%BC.jpg"
        },
        {
            "id": 8,
            "material": "鸡胸肉、盐、料酒、淀粉、葱、姜、青椒、红椒、蒜、白糖、米醋、酱油、清水、香油、花椒、干辣椒、花生米。",
            "practice": "1.鸡胸肉切1cm大小的丁，加入盐（1/2茶匙），料酒和干淀粉搅拌均匀后，腌制5分钟。蒜切成比鸡丁稍微小点的粒，葱姜切成末。青红椒切粒。 2.将蒜葱姜放入碗中，调入盐（1/2茶匙），白糖，米醋，酱油，清水，水淀粉调成汁备用。 3.锅烧热，倒入油，再添加少许香油，趁油冷时放入花椒，待花椒出香味，颜色略变深后，放入干辣椒爆香。 4.放入鸡丁炒至变色后，将青红椒粒放入，翻炒10秒钟，倒入调好的料汁，大火翻炒1分钟后，倒入炸好的花生米即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%AE%AB%E4%BF%9D%E9%B8%A1%E4%B8%81.jpg"
        },
        {
            "id": 9,
            "material": "主料：鸡胸肉250克 青红椒各4根 炸花生米50克 葱粒2茶匙（10克）姜末1茶匙（5克）蒜末1茶匙（5克）花椒15粒 干红辣椒6根。",
            "practice": "1）鸡胸肉切1cm大小的丁，加入盐（1/2茶匙），料酒和干淀粉搅拌均匀后，腌制5分钟。葱切成比鸡丁稍微小点的粒，葱姜切成末。青红椒切粒。 2）将蒜葱姜放入碗中，调入盐（1/2茶匙），白糖，米醋，酱油，清水，水淀粉调成汁备用。 3）锅烧热，倒入油，再添加少许香油，趁油冷时放入花椒，待花椒出香味，颜色略变深后，放入干辣椒爆香。 4）放入鸡丁炒至变色后，将青红椒粒放入，翻炒10秒钟，倒入调好的料汁，大火翻炒1分钟后，倒入炸好的花生米即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%AE%B6%E5%B8%B8%E5%AE%AB%E4%BF%9D%E9%B8%A1%E4%B8%81.jpg"
        },
        {
            "id": 10,
            "material": "排骨500g，山药半根，枸杞适量，胡萝卜一根，，生姜适量，料酒1茶匙，白醋几滴，八角一个，盐适量。",
            "practice": "1.排骨500g，山药半根，枸杞适量，胡萝卜一根，生姜适量切片，料酒1茶匙，白醋几滴，八角一个，盐适量。 2.山药洗净，削去外皮，切成滚刀块备用；胡萝卜同样切成滚刀块。 3.放半锅清水，放入洗净的排骨，用大火烧开，此时汤面会出现一层泡沫，这就是被煮出来的血水，关火，把排骨捞出洗净。 4.砂锅放适量水烧开（一次放够，中途不再加水），把排骨和姜、料酒、八角一起放入，用大火烧开后转小火。 5.这时加入几滴白醋，不仅可以让排骨中的钙溶入汤汁中，还能使汤味更加鲜美。醋不要加多了，否则排骨就该变味了。 6.小火煮一小时后，再放入山药、胡萝卜，小火再煮1小时，放枸杞和盐调味即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%B1%B1%E8%8D%AF%E6%8E%92%E9%AA%A8%E6%B1%A4.jpg"
        },
        {
            "id": 11,
            "material": "雪梨，冰糖，枸杞，川贝粉，白开水。",
            "practice": "1.把梨削去皮、用小刀去掉上层约1/5的顶部，挖去梨核，注意不要挖透底部。 2.把雪梨清理干净后放入冰糖、枸杞和川贝粉，添加白开水（约梨的一半就可以，蒸的时候还要渗出部分水份）。 3.上锅蒸1--1.5小时，如果用高压锅时间可适当缩短些。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%B7%9D%E8%B4%9D%E5%86%B0%E7%B3%96%E7%82%96%E9%9B%AA%E6%A2%A8.jpg"
        },
        {
            "id": 12,
            "material": "初榨橄榄油，意大利面，西红柿或番茄两个，洋葱，红辣椒，牛肉或火腿一些，葱和蒜，调味料。",
            "practice": "1、先煮面，自己尝熟了就可以，有的朋友说7-10分钟，这个不一定，我煮10分钟还是很硬...... 2、面煮好后捞出来过下凉水，然后开始备酱。 3、倒入橄榄油，注意不要把锅烧的过热，这样会破坏橄榄油的营养成分的，加入切碎的葱蒜，把肉丁放进去翻炒（肉丁事先腌一下最好了）然后加入洋葱和辣椒。 4、最关键的时刻到了~~~~要放入西红柿或是番茄，用铲子把它戳碎，盖上锅盖小火焖一下，然后加上盐和一点鸡精~~~~OK了。酱汁出锅，浇到面条上就可以开饭喽~~~ ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%84%8F%E5%A4%A7%E5%88%A9%E9%9D%A2.jpg"
        },
        {
            "id": 13,
            "material": "绿茶海绵蛋糕片适量，鲜奶油120ML，抹茶粉5克，吉利丁片1.5片，细砂糖20克。",
            "practice": "1、用模具在蛋糕片上压出所需要的，用来垫底的蛋糕片； 2、鲜奶油从冰箱拿出后分次加入砂糖坐在冰块水中打至6-7分发，然后加入绿茶粉打匀； 3、吉利丁片用水软化，隔水溶化，冷却后加入打发的鲜奶油中充分搅拌均匀； 4、将慕斯馅倒入模具，轻轻震动消除气泡后放入冰箱冷藏4~5小时； 5、在凝固的慕思蛋糕表面撒上绿茶粉和糖粉装饰； 6、用热毛巾捂慕斯圈几分钟，脱模即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%85%95%E6%96%AF%E8%9B%8B%E7%B3%95.jpg"
        },
        {
            "id": 14,
            "material": "五花肉150克、干红椒适量、花椒适量、香葱1根、八角1朵、生姜适量。",
            "practice": "1、准备好包菜。 2、准备好配料。 3、半棵包菜洗净，用手丝成大块。 4、五花肉洗干净切片，红椒剪成段，葱姜切斜片。 5、锅中烧热少许油，放入五花肉片煎炒至表面金黄、出油（油可以打出来一些） 6、把肉片拨至旁边，下入花椒、葱姜、八角和红椒，煸出香味。 7、下入包菜翻炒至稍微变软，调入一茶勺的盐翻炒均匀。 8、调入适量蚝油翻炒均匀。 9、翻炒至包菜完全",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%89%8B%E6%92%95%E5%8C%85%E8%8F%9C.jpg"
        },
        {
            "id": 15,
            "material": "黄花，木耳，香菇，大葱，鸡蛋。",
            "practice": "1、香菇木耳黄花泡发； 2、锅底放油下肉馅炒熟加入葱花香菇，加酱油、料酒、糖、盐，再加木耳、黄花、鸡精，加适量水同煮； 3、淋入打散的蛋液，勾芡撒葱花蒜末； 4、浇在面条上食用。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%89%93%E5%8D%A4%E9%9D%A2.jpg"
        },
        {
            "id": 16,
            "material": "带皮五花肉，老抽，酱油，冰糖，大葱，姜片，花椒。",
            "practice": "1、肉洗净切方块，2厘米见方，不用水焯，直接拿锅倒油适量。 2、油热后放肉入锅，炸！ 3、另起锅，倒油适量，放入葱、姜、花椒煸炒。放糖，冰糖最好。 4、熬出汁后，倒入炸好的肉，翻炒一下，倒入清水或高汤。 5、加水以略没过肉即可，加盐，加大料，大火烧开，盖上盖焖煮25分钟后，慢慢炖吧，至少一小时，越烂越好。 6、停火自然冷却，没压力后打开盖，再开火收汁，汁浓后，停火出锅。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%9C%AC%E5%B8%AE%E7%BA%A2%E7%83%A7%E8%82%89.jpg"
        },
        {
            "id": 17,
            "material": "龟苓膏粉10克，水200克，桂花蜜糖适量。",
            "practice": "1.龟苓膏粉加水放一个小锅里搅拌均匀； 2.放火上慢慢加热，要不停的搅拌，慢慢变成粘稠状时关火，倒入容器中，放入冰箱冷藏； 3.半小时后就可以了，吃时切小块，浇上桂花蜜糖即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%A1%82%E8%8A%B1%E9%BE%9F%E8%8B%93%E8%86%8F.jpg"
        },
        {
            "id": 18,
            "material": "鱼，水煮鱼调料，豆芽，小白菜，盐，料酒，生粉，蛋白，花椒，辣椒。",
            "practice": "1.豆芽，小白菜，这两盘已经用水焯过了!放入大盆中； 2.将鱼洗净，片成鱼片，并把剩下的鱼排剁成几块。将鱼片用少许盐、料酒、生粉和一个蛋白抓匀，腌15分钟。 3.在干净的炒锅中，放入调料包，加一些热水，加入鱼排，转大火，待水开，保持大火，一片片将鱼片放入，用筷子拨散，3~5分钟即可关火。把煮好的鱼及全部汤汁倒入刚才盛豆芽和小白菜的大盆中。 4.另取一干净锅，倒入半斤油(具体油量要看准备的容器大小，以倒入大盆中时，把鱼和豆芽全部淹没为准)。然后加入装有花椒及干辣椒调料包，用小火慢慢炒出花椒和辣椒的香味。注重火不可太大，以免炒糊。 辣椒颜色快变时，立即关火，把锅中的油及花椒辣椒一起倒入盛鱼的大盆中。香喷喷的水煮鱼好了! ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B0%B4%E7%85%AE%E9%B1%BC.jpg"
        },
        {
            "id": 19,
            "material": "鸡蛋 2颗,无盐奶油 50克,水 80克,低/高筋面粉 60克,盐 少许。",
            "practice": "1、鸡蛋打散、面粉过筛(喜欢松软口感者用低筋面粉，反之喜欢脆硬口感者用高筋面粉)水、盐、无盐奶油放入雪平锅中煮沸后转小火，马上将面粉全部倒入搅拌(要一直不停地搅拌)。 2、继续搅拌到面粉成团且有点半透明，关火后稍微放凉(鸡蛋加入不会变熟的温度)，慢慢分数次加入鸡蛋液，边搅拌边加蛋液，加到面团可以慢慢地流动即可将面团放入挤花袋内。将面团挤到铺着防沾烘焙纸的烤盘上，在面团上喷撒少许水。 3、烤箱预热200度C，放入烤箱200度C烤10分钟，190度C继续烤10分钟，180度C继续烤10分钟，看泡芙表皮颜色酌量增减烘烤时间，如颜色已到金黄，则关火焖至温度降低，中间不要开烤箱门，以免温度落差过大，导致于泡芙扁塌。 4、烘烤完成的泡芙放凉后可加入自己喜爱的内馅，即完成此道料理。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B3%A1%E8%8A%99.jpg"
        },
        {
            "id": 20,
            "material": "乳鸽1只、大葱1根、姜片适量、香菇、枸杞、大枣、食盐少许。",
            "practice": "1、鸽子清水浸泡10分钟，活水冲洗干净。 2、砂锅一次性加入清水，投入鸽子、姜、葱。 3、香茹用水洗净，清水泡发20分钟。 4、枸杞洗净并用清水浸泡10分钟。 5、大火把汤煮后加入香菇和枸杞转小火慢炖。 6、炖至50分钟后加入大枣，继续炖煮30分钟，喝之前调入适量食盐即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B8%85%E7%82%96%E9%B8%BD%E5%AD%90%E6%B1%A4.jpg"
        },
        {
            "id": 21,
            "material": "琵琶腿2只，干香菇6枚，枸杞子3g，葱，姜末各5g，盐1茶匙（5g）。",
            "practice": "1、将干香菇和枸杞子分别放入小碗中，用温水泡发，洗净，沥干水分，备用。 2、将琵琶腿洗净，放入锅中，加入1000ml凉水，中火烧开后，小心地撇去浮沫，加入泡好的香菇、葱、姜末，转小火炖煮30分钟。 3、将枸杞子放入锅中，继续加热10分钟，调入盐，离火，放凉。 4、待鸡汤完全放凉后，用勺子小心地将鸡汤上面的浮油完全去除干净，只留清汤，再次加热后，即可趁热食用。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%BB%8B%E8%A1%A5%E9%B8%A1%E6%B1%A4.jpg"
        },
        {
            "id": 22,
            "material": "肉末 1碗（约270公克）,豆干 3块,干香菇 5朵,红萝卜 1/2条,葱 1根,小黄瓜 1条,面条 2束,盐 少许,甜面酱 1/5杯,蠔油 1/5杯,辣豆瓣酱 1匙,白胡椒粉 适量。",
            "practice": "1、豆干切丁、香菇泡水后切丁、红萝卜切丁、葱切珠、小黄瓜切丝备用。 2、热锅放入豆干丁炒香，炒至表面呈金黄色盛起。 3、同锅放入肉末翻炒出油，放入香菇炒香，再放入作法2的豆干、红萝卜、辣豆瓣酱续炒，加入甜面酱、蠔油及水2杯煨煮即为炸酱。 4、小黄瓜丝以盐杀青，以开水冲洗后沥干。 5、将面条煮至熟成捞起盛盘，放上作法3的炸酱、作法4的小黄瓜及葱珠即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%82%B8%E9%85%B1%E9%9D%A2.jpg"
        },
        {
            "id": 23,
            "material": "土豆300克，牛肉400克，洋葱50克，大豆色拉油70克，高汤、料酒、精盐各适量。 ",
            "practice": "1、土豆洗净去皮，切成滚刀块；牛肉洗净，切成麻将般大小的方块，用沸水焯烫一下，捞出后沥水待用；洋葱切成条； 2、锅置火上烧热，倒入色拉油，然后下入牛肉块翻炒，视肉块表面无水后，下入料酒、高汤、精盐，用大火烧开后改用小火煮熟； 3、牛肉八九成熟后放入土豆，洋葱煮熟即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%89%9B%E8%82%89%E7%82%96%E5%9C%9F%E8%B1%86.jpg"
        },
        {
            "id": 24,
            "material": "牛肉 盐和生抽 桂皮 大蒜 八角 干红辣椒 料酒 醋 红茶包。",
            "practice": "1、葱、香菜、芹菜放到切碎杯碗中切碎取出。 2、番茄放到切碎杯碗切碎后取出。 3、平底锅中加油放入牛肉干、干辣椒、花椒、及步骤2切碎的番茄并加入两碗水煨煮后用直立式搅拌棒搅打均匀到味道完全释放后用滤网过滤，再重新放回锅中加热，加入酱油及盐巴调味倒入汤碗中。 4、盐水煮面并川烫小白菜。 5、平底锅加牛肉片及酸菜炒熟后与煮熟的面及小白菜加入到步骤3的汤碗中，最后摆上步骤1的香料装饰点缀即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%89%9B%E8%82%89%E9%9D%A2.jpg"
        },
        {
            "id": 25,
            "material": "小排骨300克 玉米一根 胡萝卜一根 葱 姜 料酒 盐。",
            "practice": "1）小排加料酒焯水，玉米、胡萝卜改刀，葱结姜片备用。 2）将所有原料下锅煮，烧开后撇沫，再炖60分钟。 3）最后起锅调味，点少许醋，可以更好的帮助钙质的吸收，出锅即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%8E%89%E7%B1%B3%E6%8E%92%E9%AA%A8%E6%B1%A4.jpg"
        },
        {
            "id": 26,
            "material": "大米1小碗，松花蛋1个，瘦猪肉2两，盐1勺，清水500ml，淀粉1勺，美极鲜酱油3ml，料酒3ml。",
            "practice": "1、米淘好，在电饭锅里铺平，加没过米再多5cm左右的水，盖上盖子，选“粥/汤”那档，10分钟。 2、利用这10分钟，把皮蛋用小细线切成小块儿，猪肉切成细丝，用淀粉、料酒、美极鲜酱油抓匀腌制。 3、10分钟后，放入皮蛋搅拌搅拌。 4、再等10分钟，放入腌好的肉丝、盐，充分搅拌均匀。 5、然后就等着吧，直到电饭煲的灯跳到“保温”为止。 6、吃前放上一点青葱的葱花。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%9A%AE%E8%9B%8B%E7%98%A6%E8%82%89%E7%B2%A5.jpg"
        },
        {
            "id": 27,
            "material": "大枣5个，大葱1个，水8杯，盐少量，雏鸡1只，粘米1/4杯，胡椒少量。",
            "practice": "1．雏鸡要淘内脏后，洗干净。然后在雏鸡的肚子里放粘米、蒜、大枣，为了防止里面的东西漏出来，用线缝一下。 2．把雏鸡等放在大的锅里，在放葱，倒多量的水后煮 3．雏鸡要煮很长时间。骨头可以拿出来的时候，把雏鸡捞出来就可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BA%A2%E6%9E%A3%E5%8F%82%E9%B8%A1%E6%B1%A4.jpg"
        },
        {
            "id": 28,
            "material": "糯米、血糯各200克，红枣50克，莲子50克，白果25克，葡萄干25克，红豆沙25克，樱桃10克，绵白糖100克，东洋南瓜1个。",
            "practice": "1、将南瓜横着切开，掏空，备用。 2、糯米、血糯淘洗干净，在水中浸泡2-3小时，然后上笼大火蒸30分钟至熟，加入红枣、莲子、白果、葡萄干、红豆沙、樱桃八宝原料及糖拌匀，盛入南瓜内，盖上南瓜盖，上笼旺火蒸1小时即成。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BA%A2%E6%9E%A3%E8%8E%B2%E5%AD%90%E5%85%AB%E5%AE%9D%E7%B2%A5.jpg"
        },
        {
            "id": 29,
            "material": "牛肉，鲜切面，油菜，熟鸡蛋，姜片，葱段，茶叶，干红辣椒，花椒，八角香叶，桂皮等香料。",
            "practice": "1.牛肉洗净切块飞水去掉血污，捞出； 2.锅内放少量油，加牛肉、姜片、葱段、茶叶、干红辣椒、花椒、八角香叶、桂皮炒香； 3.再加生抽、老抽、醋继续翻炒，一次性加入足量清水大火烧开后煮炖2-3小时； 4.牛肉将熟时，将香料捞出，留下牛肉清汤； 5.牛肉熟烂后加盐、糖调味； 6.另起锅，水沸后水内加少量食盐，下面，煮熟，捞入面碗内； 7.加入牛肉块、烫熟的青菜、熟鸡蛋，将牛肉汤盛入碗内即成。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BA%A2%E7%83%A7%E7%89%9B%E8%82%89%E9%9D%A2.jpg"
        },
        {
            "id": 30,
            "material": "猪蹄2只，黄酒30克，老抽40克，冰糖30克，姜2片，八角2颗。",
            "practice": "1、猪蹄剁成块，洗净焯水； 2、锅中放少许油，煸出香味，入猪蹄煸炒，加入黄酒，老抽，八角翻炒，加入清水没过猪蹄，煮沸后改小火炖约90分钟，中间要翻几次，以免粘锅； 3、猪蹄炖烂后加入冰糖，再煮约15分钟，待汤汁浓稠后出锅(其间要多次翻动)。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BA%A2%E7%83%A7%E7%8C%AA%E8%B9%84.jpg"
        },
        {
            "id": 31,
            "material": "茄子500g， 香菜、蒜适、糖、生抽、盐。",
            "practice": "1.大蒜洗净剁成蓉。 2.碗内放白糖。 3.倒入适量生抽。 4.放入蒜蓉。 5.再加入适量清水成碗汁。 6.茄子洗净备用。 7.茄子去皮切滚刀块，调少量盐煞一下水。 8.香菜切段备用。 9.锅内入油，将茄子煎至两面金黄。 10.将碗汁中加入少量淀粉，拌匀。 11.倒入茄子中，快速翻炒一下。 12.出锅前洒入蒜蓉和香菜，装盘就好。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BA%A2%E7%83%A7%E8%8C%84%E5%AD%90.jpg"
        },
        {
            "id": 32,
            "material": "牛肉，胡萝卜，土豆，西红柿，芹菜，洋葱，盐，糖，料酒，番茄酱，黄油。",
            "practice": "1将牛肉切块焯水去血沫，加入等量的胡萝卜块与土豆块炖软烂； 2将西红柿（大概4 ，5个）去皮捣碎； 3另取一口锅，放入一大块黄油融化烧至颜色稍深，加入切好的洋葱末与芹菜末（注意洋葱与芹菜等量，但西红柿大约是它们的4倒5倍）炒香后放入一瓶番茄酱（我是不舍得放那么多，所以放了大半瓶）； 4熬开后倒入牛肉汤中继续煮，直到蔬菜软烂即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/罗宋汤.jpg"
        },
        {
            "id": 33,
            "material": "洋菇 3朵,甜豆 2个,青江菜 2株,玉米笋 2根,红椒 少许,葱 1根,面条 1把,肉末 约80公克,干香菇 1朵,红萝卜 少许,姜 少许,盐 适量,白胡椒粉 少许,香油 少许。 ",
            "practice": "1、洋菇画星字、玉米笋对切、青江菜对切、干香菇泡水后切末、红萝卜切末、姜切末、葱切末及株备用。 2、肉末加入少许盐，以顺时针方向搅拌至有黏性。 3、将所有蔬菜末（干香菇1朵、红萝卜少许、姜少许、葱少许）加入肉末里，以盐、白胡椒粉、香油斟酌调味拌匀。 4、取锅川烫面条至熟成捞起备用。 5、同锅待水滚开后改小火放入肉丸，待浮起表示熟成捞起。 6、以作法5的水当汤底，放入蔬菜续煮，以盐及白胡椒粉斟酌调味，放入丸子、面条及葱珠即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%82%89%E4%B8%B8%E9%9D%A2.jpg"
        },
        {
            "id": 34,
            "material": "牛蒡 200g,花菇 5朵,栗子 100g,红枣 15粒,乌鸡 500g,水 1000c.c,九阳紫砂煲 1台。",
            "practice": "1、乌鸡切块，汆烫后洗净；牛蒡去皮切斜片；栗子、花菇分别泡水半小时；红枣泡热水10分钟后去籽备用解决； 2、紫砂锅中加入1000c.c清水； 3、将所有材料加入紫砂锅内； 4、盖上紫砂盖，选择”营养汤”功能，完成后加盐调味即可享用",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%8A%B1%E8%8F%87%E4%B9%8C%E9%B8%A1%E6%B1%A4.jpg"
        },
        {
            "id": 35,
            "material": "五花肉、料酒、山楂干（半勺醋）、酱油、盐、冰糖。",
            "practice": "1）五花肉洗净，切成麻将大小的块，在开水里焯一下； 2）锅中加水150ml，肉块和调料1，大火烧开，撇掉浮沫后，转中小火炖45分钟； 3）加调料2，继续小火炖30分钟左右，火开大收干汁水。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%8B%8F%E5%BC%8F%E7%BA%A2%E7%83%A7%E8%82%89.jpg"
        },
        {
            "id": 36,
            "material": "西红柿2粒或3粒，鸡蛋3粒，小葱1根，白糖1汤匙，白胡椒粉少许，盐少许，味精少许。",
            "practice": "1、西红柿洗净后顶部划“十”字，浇上开水烫2分钟后去皮切片； 2、鸡蛋打入碗中，加入少许白胡椒粉、盐和味精，打散备用； 3、小葱洗净后切成葱花； 4、炒锅内倒少许油烧至微热，倒入鸡蛋快速划散，凝固后盛出； 5、炒锅内重新倒入少许油烧至7成热，倒入西红柿大火煸炒，然后加入白糖炒匀，再倒入鸡蛋一起翻炒，最后调入少许盐和味精，起锅前撒上葱花即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%A5%BF%E7%BA%A2%E6%9F%BF%E7%82%92%E9%B8%A1%E8%9B%8B.jpg"
        },
        {
            "id": 37,
            "material": "豆角，瘦肉，面条，红葱头，生抽。",
            "practice": "1、热锅冷油放入红葱头，小火炒出香味； 2、放入瘦肉，翻炒至变色； 3、放入豆角； 4、翻炒至变软变色； 5、淋入生抽； 6、加入清水，水量根据面条的多少来增减； 7、豆角煮5分钟； 8、加入面条，用筷子划散，焖煮10分钟左右； 9、大火收汁至浓稠即可，试味，不够味的可以放点盐或者生抽，拌匀即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%B1%86%E8%A7%92%E7%84%96%E9%9D%A2.jpg"
        },
        {
            "id": 38,
            "material": "乌梅8公斤、砂糖50公斤、柠檬酸50克、桂花1.5公斤、糖精30克、酱色250克、成品浓缩酸梅汁120公斤可冲酸梅汤384公斤。",
            "practice": "1.按配料规定熬制酸梅汁。先将乌梅洗净，投入紫铜锅(或铝锅)内煮沸，过滤(余下的乌梅可加开水浸泡、过滤)，制成浓缩的乌梅汁。 2.熬制糖酱。先将砂糖溶解，制成所需浓度糖水，过滤除去杂质，再煮沸，加入其它辅料搅拌均匀，待冷却后使用。 3.混合原料。将冷却后的糖酱，倒入浓酸梅汁中，制成酸梅糖酱。 4.加冰水，或加食用冰和砂滤水，制成酸梅汤。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%85%B8%E6%A2%85%E6%B1%A4.jpg"
        },
        {
            "id": 39,
            "material": "腌龙利鱼片250g，酸菜叶100g，葱姜蒜60g，泡姜30g，小米辣段20g。",
            "practice": "1、蒜切成片，酸菜用自来水冲洗10分钟，挤干水分待用； 2、锅中放30g油（约两汤匙）烧热，放入泡姜、小米辣、蒜片、酸菜叶和花椒，炒出香味，放入500g水烧滚3分钟； 3、将龙利鱼片一片片放入锅中，改小火煮沸至龙利鱼熟，加入鲜汤汁，拌匀出锅。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%85%B8%E8%8F%9C%E9%B1%BC.jpg"
        },
        {
            "id": 40,
            "material": "土豆丝500克，干辣椒30克，醋10克，辣椒酱15克，大蒜10克，生姜10克，葱10克。",
            "practice": "1.把土豆去皮，切丝，边切边用冷水浸泡土豆丝，去淀粉，可以让土豆脆， 如果想配点青椒或者红椒都可以。 2.切大蒜，生姜，大葱切段。 3.热油锅，放入小红辣椒，花椒，大蒜，生姜，大葱段爆香 4.放入土豆丝，翻炒，然后加入盐，醋，如果喜欢味精的，关火以后放入，最后加点小葱，会更香哦",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%85%B8%E8%BE%A3%E5%9C%9F%E8%B1%86%E4%B8%9D.jpg"
        },
        {
            "id": 41,
            "material": "土豆1个，干红辣椒，醋，盐，花椒粉，葱，姜，蒜。",
            "practice": "1.土豆切丝，放入水中浸泡，尽量洗掉淀粉。然后捞出控干水分。 2.在油锅内放入葱、姜、蒜、干辣椒翻炒几下，再放入土豆丝翻炒一会加入盐和花椒粉，炒几下临出锅前放入白醋炒匀即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%86%8B%E6%BA%9C%E5%9C%9F%E8%B1%86%E4%B8%9D.jpg"
        },
        {
            "id": 42,
            "material": "银耳，莲子，枣子，枸杞，冰糖各适量。",
            "practice": "1、银耳用清水泡开，将底部泛黄的硬结剔出，然后撕碎备用。一般就用三、四朵即可。 2、莲子需要中间无芯的，不苦，放置多少随自己喜好。 3、汤锅放清水，水要一次放够，要留出蒸发的余地，煮的过程中间不可加水。 4、将银耳、冰糖（三两左右）、枣子、枸杞放入冷水中，开火，加热，煮沸，一定要不断搅锅，防止银耳胶质粘锅，煮开后，关小火熬煮，也要不断搅锅。 5、莲子易熟稍后放入。 6、开锅后继续熬煮，直到银耳胶化，汤粘稠即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%93%B6%E8%80%B3%E8%8E%B2%E5%AD%90%E6%B1%A4.jpg"
        },
        {
            "id": 43,
            "material": "五花肉250g，青椒3个，豆豉5ml，豆瓣酱5ml，盐3g，花椒2g，葱段适量。",
            "practice": "1、青椒洗净，切成滚刀块。 2、五花肉洗净放入锅中，加入适量清水，放入花椒粒、料酒以及葱段，煮半小时左右。 3、五花肉捞出来，放入冷水中洗净，然后切成2-3毫米左右的薄片。 4、锅中加入少许食用油烧热，加入五花肉煸炒至打卷。 5、加入豆豉和豆瓣酱，快速翻炒均匀，使肉片入味。 6、加入青椒，翻炒至青椒变熟即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%9D%92%E6%A4%92%E5%9B%9E%E9%94%85%E8%82%89.jpg"
        },
        {
            "id": 44,
            "material": "花鲢鱼3斤，泡青菜1片，泡姜1个，泡椒3根，蒜颗粒，鲜青花椒50克，干辣椒10根，郫县豆瓣，大葱段，料酒，豆粉，蛋清1个，盐，味精，白胡椒粉。",
            "practice": "1、花鲢鱼买的时候处理干净，鱼片哈。拿回家清洗干净，沥干水份，用1个蛋清、豆粉、料酒、盐一起码味。 2、泡菜切粗丝、泡椒切段、泡姜切颗粒、蒜颗粒、干辣椒切段。 3、热油锅把泡菜、泡椒、泡姜、蒜、豆瓣、干花椒一起炒香，掺水，放胡椒粉。先把鱼头、鱼排一起烧开。 4、熬3分钟后，再把鱼片放进煮熟，放盐、葱段、味精即可。 5、倒入一个大盆中，把鲜青花椒、干辣椒放在鱼上，淋上热油即可。味道清香美味。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%9D%92%E8%8A%B1%E6%A4%92%E9%85%B8%E8%8F%9C%E9%B1%BC.jpg"
        },
        {
            "id": 45,
            "material": "：猪瘦肉、冬笋、黑木耳、胡萝卜，葱、蒜、姜、自制剁椒、肉汤、盐、糖、醋、生抽、淀粉。",
            "practice": "1、将泡发的黑木耳切丝，玉兰片切丝，猪瘦肉切丝，葱姜蒜切末。 2、将肉丝用少许盐、料酒和淀粉将肉丝稍腌。并将淀粉、盐、白糖、醋、生抽、肉汤（或水）兑成调味汁。 3、热锅下冷油，油温热后，下肉丝迅速划炒散开。 4、炒至肉色变白后用铲子将肉丝拨在锅边（或盛出），底油加自制剁椒、蒜末、姜末炒香。 5、将肉丝翻炒均匀。 6、加入事先绰水后的胡萝卜丝煸炒一分钟左右。 7、然后下入玉兰丝和黑木耳丝大火煸炒片刻。 8、倒入芡汁。待汤汁粘稠时加葱花翻炒均匀即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%B1%BC%E9%A6%99%E8%82%89%E4%B8%9D.jpg"
        },
        {
            "id": 46,
            "material": "咸鱼1块，茄子1根，姜蓉，葱花，蒜，黄豆酱，小红辣椒。",
            "practice": "1、茄子洗净去头，切条，用盐水泡5分钟；咸鱼切粒。 2、热锅下油，油热倒入切好的茄子，翻炒约3分钟就熟的了，装上碟备用。 3、锅放油，放入姜蒜葱辣椒炒香，放入咸鱼和一勺黄豆酱，炒香。 4、加入适量的水和一点点糖，搅拌均匀，烧开。 5、汤汁开倒入茄子，大火炒约1分钟，装盘撒葱花辣椒就好了。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%B1%BC%E9%A6%99%E8%8C%84%E5%AD%90.jpg"
        },
        {
            "id": 47,
            "material": "鲫鱼1条，金针菇250g，枸杞子10粒，大葱适量，小葱适量，姜适量。",
            "practice": "1、鲫鱼去腮开膛收拾干净，在两侧鱼身都用刀划3个口子。 2、下油锅煎至两面金黄色取出备用。 3、把鱼放入砂锅或汤锅内，加入适量的水，最少要没过鱼身。加入料酒、盐、葱段、姜片。开大火加盖煮。 4、等开锅加入枸杞子，换小火煮20分钟。 5、20分钟后，再加入金针菇。 6、5分钟后即可出锅，撒入小葱末装扮，美味完成。 ",
            "url": "https://github.com/duanCoin/nutrition-recipes-image/blob/master/image/%E9%B2%AB%E9%B1%BC%E6%B1%A4.jpg"
        },
        {
            "id": 48,
            "material": "鲫鱼一条，豆腐若干，盐，姜，葱，鸡精，料酒。 ",
            "practice": "1.鲫鱼一条，收拾干净沥水；豆腐若干，切成块或片，撒上盐；老姜切丝，另留下半块留作擦锅用；小葱。葱白段寸段，葱叶切碎。 2.炒锅烧干烧热，用刚才留的那半块姜擦擦后再油烧得开始冒烟时，将鱼丢进去中。怕溅油的此可以盖上锅盖~ 3.适当转锅，待一面煎好后再煎另一面。 4.烹入料酒，加入葱白段及姜丝，然后加两碗清水，放进豆腐大火烧开，加鸡精及适量盐，因为之前豆腐里已经有盐了，最好是尝尝汤的味道后再酌量添加盐。继续保持大火状态~（我加的是凉水，水要一次加够，最好不要中途加水；若必须添水，可加热水。） 5.大火煮约10~15分钟，看看，汤已经很白了吧。出锅，装盘撒上少许葱（叶）花即可~ ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%B2%AB%E9%B1%BC%E8%B1%86%E8%85%90%E6%B1%A4.jpg"
        },
        {
            "id": 49,
            "material": "肉酱罐头 1罐,板豆腐(切丁) 1盒,姜 2片,葱末 少许,蒜末 少许,米酒 少许,酱油膏 2匙。",
            "practice": "1、倒入[肉酱罐头]，中火--->加入[姜]、[蒜末]、[酱油膏]及少许[米酒]炒去罐头味。(罐头已有油份，不需再另添加油~以免摄取过多油量) 2、沸滚后--->倒入[板豆腐(切丁)]收汁。(豆腐本身就会出水，收汁后会与肉酱融合，不需再另勾欠) 3、确认豆腐每面均收汁后，加入[葱末]翻炒即可收火。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%BA%BB%E5%A9%86%E8%B1%86%E8%85%90.jpg"
        },
        {
            "id": 50,
            "material": "鲤鱼2斤，青椒水煮鱼调料1袋（150克），葱姜蒜、干红辣椒、花椒粒、植物油、淀粉、料酒、香菜、盐， 小油菜2棵、豆芽菜100克，平菇、芹菜、莲藕等蔬菜根据自己喜好选择。 ",
            "practice": "1、鲤鱼1000克，去掉腮、两侧挑去神经线，洗掉腹内黑膜，鱼肉片成片，鱼骨切段，用淀粉、盐、料酒腌制半小时。 2、我选择的蔬菜是油菜、平菇、豆芽菜、芹菜、莲藕、豆腐皮、胡萝卜，上述菜清洗后，莲藕胡萝卜切片、芹菜去叶切段，豆腐皮切粗条，平菇撕小块，油菜一片片摘开，然后分别在沸水中焯，捞出放到一个较大的器皿中，我将菜放在一个电热锅里，可以调到文火档保温。 3、姜切片、葱切段、大蒜拍扁。香菜切段。 4、锅内放植物油，烧热后放入姜葱蒜煸炒，放入水煮鱼调料，炒出香味后加水，水量根据鱼的大小和菜的分量。小火煮30分钟，调料里的香味才会充分溶于水中，汤的味道更加浓郁。 5、腌制好的鱼片、鱼头骨等，分片放入汤锅中，煮五六分钟，连汤带鱼片倒入放蔬菜的器皿中。 6、另取一锅，烧油，改小火，放入干辣椒和花椒粒，炸出香味后泼在鱼片上，撒上香菜即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%BA%BB%E8%BE%A3%E6%B0%B4%E7%85%AE%E9%B1%BC.jpg"
        },
        {
            "id": 51,
            "material": "鲜河虾仁、100克鸡蛋清、1个龙井茶、少许调味料盐、10克味精、2克色拉油、20克湿淀粉、少许 ",
            "practice": "1、用清水反复搅洗至虾仁洁白，沥干水，加入盐、味精、鸡蛋清，搅拌至有粘性时，加入湿淀粉； 2、龙井茶用沸水泡开待用； 3、炒锅置中火上烧热，滑锅后，下色拉油烧至四成热，放入虾仁，滑散后倒去油，再将茶叶和茶水一起烹入，即可出锅装盘。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%BE%99%E4%BA%95%E8%99%BE%E4%BB%81.jpg"
        },
        {
            "id": 52,
            "material": "薏米25g、赤小豆15g、糯米15g、无心莲子10克。",
            "practice": "1、薏米、赤小豆和莲子洗净，提前浸泡12小时； 2、莲子洗净，浸泡3小时，糯米洗净，备用； 3、锅中倒入适量清水，大火煮开； 4、放入泡好的薏米、赤小豆和莲子； 5、大火煮30分钟，再放入糯米； 6、转中火煮30分钟，用勺子搅拌，煮至粘稠即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BA%A2%E8%B1%86%E8%96%8F%E7%B1%B3%E7%B2%A5.jpg"
        },
        {
            "id": 53,
            "material": "酸奶100克，牛奶3盒。",
            "practice": "1、准备鲜奶3盒、酸奶1杯。 2、用开水将容器烫一下，约1分钟，主要是灭菌。 3、将纯牛奶倒入容器内，再倒入酸奶（做引子），用勺子搅拌匀。 4、将盖好的容器放入酸奶机内，改好上盖，接通电源。 5、8-12小时后，酸奶自动做好。我是晚上8.30做，到第二天早上6点多拔掉电源，把酸奶盒移到冰箱。 6、刚发酵好的酸奶，可以立即食用，但经过冰箱冷藏，进行纯化24小时，口感更佳，香味纯正。 7、打开看看，酸奶凝固得象豆腐脑似的就成功了，应该用平湖如镜来形容。加上应市的水果颗粒拌着吃，味道会更美！ ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%87%AA%E5%88%B6%E9%85%B8%E5%A5%B6.jpg"
        },
        {
            "id": 54,
            "material": "抹茶粉13克，牛奶160克， 淡奶油320克，糖25克（牛奶用），蛋黄4个， 糖25克 （蛋黄用），盐 1克。",
            "practice": "1、抹茶粉加牛奶搅拌均匀至无颗粒，我用的搅拌机打的； 2、把淡奶油、抹茶牛奶和25克糖放进锅中，加热至刚刚沸腾； 3、蛋黄加25克细砂糖，打发至变白浓稠； 4、把加热好的抹茶牛奶缓缓倒入蛋黄中，并不断搅打； 3、把抹茶糊过滤一下倒回锅中； 4、小火加热，边搅拌至80℃，变浓稠； 5、加入盐，搅拌均匀，放凉之后贴着液体盖上保鲜膜，放冰箱冷藏过夜； 6、冰淇淋桶冷藏16h以上，打开冰淇淋桶，倒上抹茶糊，20min就OK啦。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%8A%B9%E8%8C%B6%E5%86%B0%E6%B7%87%E6%B7%8B.jpg"
        },
        {
            "id": 55,
            "material": "牛肉馅，葱花，蔬菜鸡精，鸡汁，花椒面，油，盐。生抽，花椒水，白菜，萝卜，面粉",
            "practice": "1、先拌牛肉馅，加葱花、蔬菜、鸡精、鸡汁、花椒面、油、盐、生抽，开始顺劲搅拌肉馅。 2、然后事先准备好花椒泡好的水，开始打水入肉馅，再继续搅拌，馅子必须搅拌好，才能好吃。 3、再打一次水，再次搅拌，最后就是这样了。 4、准备菜馅子：一棵白菜、半个白萝卜切碎后，把水分挤干净，拌入肉馅，再次搅拌。 5、盐可以在放肉馅的时候放好了，之后就不用放了，也可以尝一尝，再放。 6、之后开始擀皮包包子了，这里就不详细叙述了，大家应该都会的。 7、平底锅备好，放一些油，烧好。小包子逐个，分开摆放整齐。正好放了10个。 8、放入一碗淀粉水，稀释的那种，大概没到包子的褶皱的位置就可以。三分之一处，盖盖子开始煎吧。 9、煎锅里的包子不用管，最后，水变少了，发出滋滋的响声就好了。注意火不要太大。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B0%B4%E7%85%8E%E5%8C%85.jpg"
        },
        {
            "id": 56,
            "material": "荷叶若干，绿豆2把，粳米250克，冰糖若干。",
            "practice": "1.荷叶洗净，放到开水里煮20分钟。煮好后，过滤汁液，去除荷叶。 2.高压锅中入洗干净的粳米和绿豆，加入熬好的荷叶汁，盖盖压阀开煮。大火喷气后，转小火熬煮20分钟关火。 3.开盖后加入冰糖，至冰糖充分融化。 4.粥凉后，放入到冰箱里冷藏15分钟，即可使用。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%BB%BF%E8%B1%86%E5%86%B0%E7%B3%96%E7%B2%A5.jpg"
        },
        {
            "id": 57,
            "material": "白菜，姜，调料，葱，羊肉，淀粉。",
            "practice": "1.羊肉，葱姜，调料。 2.还要加些白菜~ 3.搅拌均匀~ 4.这一步很关键，用淀粉熬成的“浆糊”，调兑到肉馅里~ 5.继续搅拌均匀~这个光荣而艰巨的任务是我哥完成的！ 6.我像模像样的跟着学如何包烧麦，其实就是装模作样！哈哈~ 7.很快就捏好了，不过如果按我包的速度来估计全家人都要饿昏了，哈哈哈~ 8.摆上蒸笼~",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%83%A7%E9%BA%A6.jpg"
        },
        {
            "id": 58,
            "material": "饺子皮500g、猪肉500g、香菇6朵、芹菜100g、胡萝卜100g。",
            "practice": "1、猪肉剁碎，香菇、芹菜和胡萝卜都切碎。 2、将步骤1的材料加入盐、鸡精调味料，搅拌均匀。 3、接下来包饺子。 4、锅里加适量水，烧开，放入饺子，煮熟就好，非常美味。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%A6%99%E8%8F%87%E8%82%89%E9%A6%85%E9%A5%BA.jpg"
        },
        {
            "id": 59,
            "material": "水面200g、空心菜100g，盐适量、花生米适量、蒜末2勺、味精半勺、猪油1勺、姜末2勺、芽菜适量、熟菜籽油1勺、辣椒油2勺、花椒粉1勺、鸡精半勺、黄豆酱油2勺、葱适量。 ",
            "practice": "1. 准备各种调料； 2. 把姜蒜剁成末放入碗里，把香葱摘洗净切成葱花； 3. 趁着煮面的水没开的时间调汁：调入两勺酱油、半勺鸡精、味精半勺、一勺葱花、； 4. 两勺花椒面； 5. 两勺红油辣椒； 6. 一勺猪油，一勺熟菜籽油，一勺花生米和芽菜； 7. 在调料碗中加入两勺面汤，家里如果有骨头汤是最好了； 8. 水烧开后放入小把面，然后快速用筷子搅散，放入空心菜，煮到断生（用手掐开一截面，没有白点即可）就可以装碗了； 9. 把空心菜先挑入碗中，再挑入面条即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%87%8D%E5%BA%86%E5%B0%8F%E9%9D%A2.jpg"
        },
        {
            "id": 60,
            "material": "小米100克、南瓜100克、胡萝卜一根。",
            "practice": "1、南瓜去皮切小块，胡萝卜洗净切小块。 2、小米洗净，放入清水锅中煮沸后转小火。 3、将南瓜块和胡萝卜块放入锅中和小米小火一起熬煮1小时即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%B0%8F%E7%B1%B3%E5%8D%97%E7%93%9C%E7%B2%A5.jpg"
        },
        {
            "id": 61,
            "material": "猪小排 一根（150克） 油麦菜 70克 大米 50克 黑小米 40克 姜 1片 料酒 2勺 ",
            "practice": "1、排骨洗净，放入1片姜，加两勺料酒，拌匀后放入冰箱冷藏一个小时以上。2、大米洗干净后浸泡半小时。3、锅中加入水，水的量是米的12倍（一杯米，12杯水）。将腌制好的排骨与冷水一起下锅煮。4、水开后加入大米和黑小米。5、继续保持中大火的状态，用勺子不断的朝同一个方向搅拌。大约3分钟后，转小火煮30分钟。6、中途搅拌2,3次，防止粘锅底。7、锅快好了，将油麦菜切碎，入锅，大火。8、搅拌，2分钟后加少许盐出锅。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%8E%92%E9%AA%A8%E6%B2%B9%E9%BA%A6%E8%8F%9C%E7%B2%A5.jpg"
        },
        {
            "id": 62,
            "material": "大米100克、 熟黑芝麻30克、 蜂蜜。",
            "practice": "1、大米淘洗干净，浸泡30分钟；2、电饭煲中加入开水，放入已经浸泡过的大米，点击手机开始烹饪图标进行煲粥；3、开锅后加入黑芝麻再煮20分钟，大米熟烂即可关火；4、晾凉至温热时，调入适量蜂蜜即可食用。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%8A%9D%E9%BA%BB%E8%9C%82%E8%9C%9C%E7%B2%A5.jpg"
        },
        {
            "id": 63,
            "material": "小米 100g、枸杞子 10g、姜 一块、清水 四碗、鱼胶须 70g、 燕麦 100g、盐 适量。",
            "practice": "1、鱼胶须提前用清水浸泡一个小时。这个鱼胶须因为小所以很容易泡发，并且无添加防腐剂等物质，没有腥味，可以放心食用。泡发后洗净备用。2、燕麦、小米和枸杞子用清水淘洗干净。3、把所有材料放入电饭锅中，加入四碗清水。姜也切成薄片放入锅中。4、盖上锅盖，调好预约时间和设定煲粥程序，就可以睡大觉去了！明天醒来就有香糯可口的早餐吃了，很是方便。5、煲好的粥加盐调味即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%85%BB%E8%83%83%E9%B1%BC%E8%83%B6%E7%B2%A5.jpg"
        },
        {
            "id": 64,
            "material": "糯米粉100克，粘米粉20克，清水90克，自制甜酒酿300克，冰糖10克，干桂花少许。 ",
            "practice": "1、糯米粉、粘米粉放入盆里，倒入清水，和成面团； 2、揪一小块面团放入开水锅里，煮至面团浮起的时候，捞出； 3、捞出的面团与和好的糯米面团揉在一起，揉至非常光滑； 4、面团搓细，切成合适的大小，再搓成小圆球； 5、备齐的材料，酒酿也是自己做的； 6、锅中放适量的水，水开后放入圆子，煮至圆子浮起时，放入酒酿；连汤带米一起放入锅中； 7、再次煮开后，放入一块冰糖，放入干桂花； 8、煮好的酒酿圆子，盛入碗中可以开喝。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%A1%82%E8%8A%B1%E9%85%92%E9%85%BF%E5%9B%AD%E5%AD%90.jpg"
        },
        {
            "id": 65,
            "material": "藜麦糕点粉 100克、 全蛋 1个、 蛋黄 1个、 牛奶 400克、 黄油 30克、 白糖 100克、 香草精 5克、 精盐 2克。 ",
            "practice": "1、将牛奶隔水慢慢加热，并放入室温融化的黄油、香草精搅拌均匀。2、鸡蛋和白糖混合在一起，搅拌均匀。3、将蛋糖液体和牛奶混合物放在一起。4、搅拌均匀，充分混合，分次加入糕点粉。5、搅拌均匀后，放入冷藏静置，至少24小时以上。6、搅拌均匀后，放入冷藏静置，至少24小时以上。7、将面糊倒入学厨可丽露模具中，烤箱预热220度，烤15分钟后，降为180度，继续烤45分钟。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%8F%AF%E4%B8%BD%E9%9C%B2.jpg"
        },
        {
            "id": 66,
            "material": "黄油或植物黄油200克、红砂糖100克、鸡蛋2个、面粉175克、蛋糕发粉、2大勺桂皮粉、1大勺苹果（中等大小）、3-4个果仁（榛子或核桃仁）50克 。",
            "practice": "1、黄油加热至软化，加入红砂糖，拌成糊状，再逐个打入鸡蛋，充分搅拌，成均匀的蛋糊状。 2、面粉、蛋糕发粉与桂皮粉，混拌均匀，掺入蛋糊浆，拌成均匀的面糊。 3、苹果洗净，削皮去核，切成小块；果仁切碎，一起拌入面糊中。 4、取容量约1公升的长方形烤盒，内面涂油防粘，倒入面糊，摊平。 5、烤箱预热至175℃，烤盒置中层，烤60-70分钟即成。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%8B%B9%E6%9E%9C%E8%9B%8B%E7%B3%95.jpg"
        },
        {
            "id": 67,
            "material": "蛋黄2个，飞饼皮2张，淡奶油60ML，牛奶60ML，白砂糖10g。",
            "practice": "1.蛋黄，淡奶油，牛奶，白砂糖搅拌均匀，最好能过筛，然后放冰箱冷藏. 2.飞饼皮软化后，两张叠在一起，稍微擀薄.卷起来冷藏10。 3.饼皮切成小剂子。 4.两个叠在一起。 5.两面沾面粉。 6.在蛋模里按成底稍薄的皮子。 7.每个挞皮里倒入八分满的蛋液。 8.烤箱220度，25分钟左右。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%9B%8B%E6%8C%9E.jpg"
        },
        {
            "id": 68,
            "material": "绿豆粉200克、细砂糖60克、糯米粉40克、薄荷水120ml。",
            "practice": "1、薄荷干提前用热水浸泡，取薄荷水。 2、将绿豆粉、细砂糖、糯米粉混合。 3、慢慢倒入薄荷水。 4、用筷子搅匀。 5、放在锅里盖上保鲜膜，隔水蒸半小时左右。 6、蒸好稍微放凉。 7、取一小团，放入模具。 8、压好之后脱膜即成。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%AF%9D%E6%A2%85%E7%BB%BF%E8%B1%86%E7%B3%95.jpg"
        },
        {
            "id": 69,
            "material": "高筋面粉 100克、 酵母 2克、 香肠 适量、 鸡蛋 一个、 生菜 适量、 沙拉酱 适量。",
            "practice": " 1、面团发酵好后备用，2分成6份小挤子揉成团；2、揉成团后放入模具里二次发酵；3、发酵好后，放入烤箱，180℃上下火烤20分钟即可；4、出炉后，一切两半，肠切片底抹上一层沙拉酱，一层生菜一层肠；5、在抹上一层沙拉酱，盖上，香肠汉堡做好了。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%A6%99%E8%82%A0%E6%B1%89%E5%A0%A1.jpg"
        },
        {
            "id": 70,
            "material": "鸡蛋 4个、 玉米油 40g、 低筋面粉 40g、 水 40g、 细砂糖 40g、 白醋 1/4小勺。",
            "practice": "1、4个鸡蛋分出蛋黄和蛋清，注意容器要干净无水无油;2、2蛋黄里面水、玉米油、15g的细砂糖里面搅拌均匀，完全混合；3、筛入低筋面粉里面；4、用手动打蛋器搅拌成没有颗粒的酸奶状；5、蛋清用电动打蛋器搅打，分次加入20g细砂糖里面；6、打到湿性发泡的状态，取1/3的蛋白到蛋黄糊中，再将剩下的2/3的蛋白倒入里面；7、翻拌均匀，完全混合，倒入铺了油纸蛋糕模具里面；8、放入预热好的烤箱，中下层上下管170度，20分钟左右，烤好胡取出，撕掉油纸，晾凉；9、放到室温的温度后，下面铺张油纸，翻过来，切去四周的边边，利用擀面杖卷起来；10、用保鲜膜包起来，放入冰箱冷藏1小时帮助定型，拿出来就可以切开吃了。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E5%B0%8F%E5%9B%9B%E5%8D%B7.jpg"
        },
        {
            "id": 71,
            "material": "材料白米1杯，干贝3粒，鸡胸肉150克，香菇4片，马蹄5粒，葱花少许调味料(1)料酒1大匙，盐1／4茶匙，淀粉少许(2)水9杯，盐1茶匙，胡椒粉少许 ",
            "practice": "1、干贝用1杯水泡软、蒸熟、撕成丝；鸡胸肉切丝，拌入调味料(1)略腌；香菇泡软、去梗、切丝；马蹄洗净、切片。 2、白米洗净，加水8杯浸泡20分钟，移到炉火上煮开，放入香菇、干贝和马蹄，改小火煮粥。 2、待粥熬好时加入鸡肉煮熟，加盐和胡椒粉调味后熄火，再加入葱花即可盛出食用。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%99%BE%E7%B1%B3%E5%B9%B2%E8%B4%9D%E7%B2%A5.jpg"
        },
        {
            "id": 72,
            "material": "水果（可以任意配搭，想在视觉及味觉上也同样得到享受，就要注意水果的搭配了，现挑选了杨桃、橙、苹果及草霉作组合），酸奶一盒。",
            "practice": "1、首先要将水果冼干净，切好。 2、然后将水果铺好。 3、最后将酸奶均匀淋上铺好的水果上，即可品尝。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B0%B4%E6%9E%9C%E9%85%B8%E5%A5%B6%E6%8D%9E.jpg"
        },
        {
            "id": 73,
            "material": "大西红柿3个，海鲜菇一盒，小油菜3棵，长寿乌东面500克，姜粒少许，葱花少许，盐一大勺，鸡精一小勺，香油少许",
            "practice": "1、把西红柿洗净，用开水烫一下，去皮，切成小块，然后把小油菜洗净用水焯一下，放在一边备用，海鲜菇洗净。 2、坐锅热油，爆香姜粒，然后放入西红柿，一边炒一边用铲子把它搅碎，直到炒出香味，然后加入冷水，盖上锅盖。 3、等西红柿汤煮开以后，加入海鲜菇，再煮开以后就加入盐和鸡精，然后把汤盛出来，放在一边。 4、另起锅加水煮面，等水开以后就可以放入面了，再加入两次冷水面差不多就好了。 5、把面放入刚才煮好的汤里面，加入焯好的青菜，搅拌均匀然后撒上葱花，浇上香油就可以吃了。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E7%95%AA%E8%8C%84%E4%B9%8C%E5%86%AC%E9%9D%A2.jpg"
        },
        {
            "id": 74,
            "material": "蛋清100g，蛋白糖粉100g，杏仁粉125g，糖粉125g。",
            "practice": "1、过筛后的杏仁粉和糖粉混合均匀后备用； 2、蛋清、1/3的蛋白糖粉放置搅拌器皿内，中速搅拌至粗泡，再加入1/3的蛋白糖粉。搅拌均匀； 3、再加入最后的1/3蛋白糖粉拌匀改为快速打至干性起泡； 4、缓慢的加入混合好的杏仁粉和糖粉，手动拌匀即可； 5、将拌好的面糊装至裱花袋，在不沾布或者油纸上挤制出形； 6、挤制好后，自然风干30min； 7、将烤箱调制焙烤档175度，烤制约12min即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%A9%AC%E5%8D%A1%E9%BE%99.jpg"
        },
        {
            "id": 75,
            "material": "有机桥麦面 200克,豆芽菜 100克,苦茶油 1匙,香椿酱 2大匙,酱油 少许,盐。",
            "practice": "1、锅中放水煮滚，先将豆芽菜快速入水汆烫捞出放盘；2、面条用水清洗，放入滚水中煮，中途需加冷水，使面条煮透，捞取与豆芽菜放一起；3、 拌入调味料，用筷子拌调均匀即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E9%A6%99%E6%A4%BF%E6%8B%8C%E9%9D%A2.jpg"
        },
        {
            "id": 76,
            "material": "低粉60克，肉松，清水45克，沙拉油35克，玉米粉10克，鸡蛋3个，糖65克，葱花。",
            "practice": "1.准备材料； 2.蛋黄加糖搅拌； 3.加入色拉油搅拌； 4.分次加入水搅拌； 5.加入过筛好的面粉和玉米粉； 6.搅拌好； 7.蛋白打至中性发泡； 8.少许的蛋白和面糊自下而上搅拌； 9.再全部搅拌好； 10.烤盘里放油纸； 11.倒入面糊； 12.撒上肉松； 13.撒上葱花； 14.烤箱170度预热第二层20分钟； 15.将蛋糕卷倒扣在油纸上，抹上果酱； 16.卷起切段即可。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%82%89%E6%9D%BE%E8%9B%8B%E7%B3%95%E5%8D%B7.jpg"
        },
        {
            "id": 77,
            "material": "小芒果，西米，牛奶（或椰奶），蜂蜜 。",
            "practice": "1、锅中加水烧开，将西米倒入锅中，转小火，盖盖子煮。(水量加足一些，煮时中途不时搅一下，避免糊底)； 2、等待煮西米的过程中，我们来处理芒果。将芒果沿着果核切开，用刀在果肉上划十字刀，再把果皮翻转，沿着果皮用刀将果肉轻轻切下； 3、大约25分钟后，看西米煮至透明，只剩中间一点小白点时，关火，盖上盖子焖5分钟。待西米完全变透明时，用网筛捞起，过一遍凉开水即可，是不是晶莹剔透的QQ感觉了； 4、再倒入牛奶和椰汁中，搅拌均匀。待西米在牛奶中浸泡15分钟后，加入芒果和少许蜂蜜，即可； 5、如果放入冰箱稍微冷藏一下吃起来效果会更佳。浓浓的芒果味，还有椰汁的清香味，牛奶的滑，西米的Q劲，这个夏天芒果西米露值得你一试着。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%8A%92%E6%9E%9C%E8%A5%BF%E7%B1%B3%E9%9C%B2.jpg"
        },
        {
            "id": 78,
            "material": "鲜面条，小油菜，绿豆芽，鹰嘴豆，红椒粉，辣椒粉，深色花椒粉，盐，生抽，醋，葱花，蒜末，香菜。",
            "practice": "1.烧一锅水，沸腾后，加一点油和盐，放入豆芽和小油菜烫熟； 2.捞出蔬菜沥干，放入面条煮熟，也可以过一下凉开水； 3.把面条和蔬菜都放在盘子里，加一些生抽和醋，我还加了一些煮熟的鹰嘴豆，蒜和葱切末，放在面条上，再加入红椒粉，花椒粉，辣椒粉和香菜； 4.炒锅倒入一些油烧热，浇到各种粉和葱蒜末上，拌匀即可。 ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B2%B9%E6%B3%BC%E9%9D%A2.jpg"
        },
        {
            "id": 79,
            "material": "海米，米，姜片，葱花，水，盐。",
            "practice": "1、海米适量温水泡软后洗净，与适量姜片、米、水一起放到锅里煮； 2、至米煮成粥后，加少量盐调味，出锅时撒少许葱花（也可撒到碗里）。",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E6%B5%B7%E7%B1%B3%E7%B2%A5.jpg"
        },
        {
            "id": 80,
            "material": "水或牛奶168克，糖1大匙，酵母粉4克，中粉300克，虾皮，香油，花椒粉，葱花，芝麻酱或肉酱后肉松。",
            "practice": "1.水或牛奶168克加入一大勺的糖和4克酵母粉搅匀.倒入300克中粉和面光滑面团后发酵到两倍大取出.其它做法请参照红糖馒头. 2.我一般把烘香的虾皮切碎. 3.在面皮上抹一层香油，抹盐，再抹一层花椒粉(也可以是胡椒粉). 4.洒上虾皮碎和葱花，卷起切段.你想放肉松.想抹芝麻酱或肉酱也行.只要是你的家人喜欢吃的. ",
            "url": "https://raw.githubusercontent.com/duanCoin/nutrition-recipes-image/master/image/%E8%8A%B1%E5%8D%B7.jpg"
        }
    ];

    collection.insert(data, function (err, result) {
        if (err) {
            console.log('Error:' + err);

            return;
        }
        callback(result);
    });
};

MongoClient.connect(DB_CONN_STR, function (err, db) {
    console.log("\n" + "******connect succeed*******" + "\n");
    insertData(db, function (result) {
        console.log("\n" + "insert succeed" + "\n");
        console.log(result);

        db.close();
    });
});
module.exports = insertData;

